blog/2012/04/25/mysql-in-a-query-batch-updates/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>MySQL:在一次查询中进行批量更新 - Gu Weigang</title>
  <meta charset="utf-8" />
  <meta name="author" content="Gu Weigang" />
  <meta name="description" content="" />
  <meta name="keywords" content="mysql, batch updates" />

  <link rel="alternate" title="RSS Feed" href="/rss.xml" type="application/rss+xml">

  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="/media/css/prettify.css" type="text/css">
</head>

  <body class="container">
<header id="header">
  <h1 class="title"><a href="/">Gu Weigang</a></h1>
  <ul>
    <li><a href="/blog/">Blog</a></li>
    <li><a href="/tags/">Tags</a></li>
    <li><a href="/about/">About</a></li>
  </ul>
  <form method="get" id="search" action="https://duckduckgo.com">
    <input type="text" class="field" name="q" id="s" placeholder="Search">
    <input type="hidden" name="as_sitesearch" value="guweigang.com">
  </form>
</header>

<section id="content" role="main">
  <h1>MySQL:在一次查询中进行批量更新</h1>
  <p>
为了提高工作效率以及节省人力时间，批量操作在现在的应用中越来越常见。
</p>

<p>
对于数据库来说，无非是“插删改查”，“查询”和“删除“自然不在话下，但是”删“的话我们一般遵循单查询批量=1000=这个上限，再多可能会影响数据库同步延迟。
</p>

<p>
而批量”插入“则可以通过拼SQL方式实现，即：
</p>

<p>
INSERT INTO tbl\_name (a,b,c) VALUES(1,2,3),(4,5,6),(7,8,9);
</p>

<p>
当然，我们要限制单条SQL的大小，一般来说10Ｍ吧。
</p>

<p>
但是对于批量“更新”呢？能不能单查询批量更新（这里的批量更新指的是=Where=之后只有单条结果的情况）呢？ 下面来看看批量“更新”的几种方案：
</p>



<ol class="org-ol">
<li>使用=INSERT ... ON DUPLICATE KEY UPDATE=
</li>
</ol>

<p>
INSERT INTO table (id,Col1,Col2) VALUES (1,1,1),(2,2,3),(3,9,3),(4,10,12)
ON DUPLICATE KEY UPDATE Col1=VALUES(Col1),Col2=VALUES(Col2);
</p>

<p>
这种方法倒是简单，但是官方文档有提示在Multi Unique Index的时候慎用，官方文档原话如下：
</p>



<blockquote>
<p>
In general, you should try to avoid using an ON DUPLICATE KEY clause on tables with multiple unique indexes.
</p>
</blockquote>





<ol class="org-ol">
<li>使用MySQL的Case语句,原型如下：
</li>
</ol>

<p>
CASE case\_value
 WHEN when\_value THEN statement\_list
 [WHEN when\_value THEN statement\_list] ...
 [ELSE statement\_list]
END CASE
</p>


<p>
在更新时则这么用：
</p>

<p>
UPDATE table SET Col1 = CASE id 
 WHEN 1 THEN 1 
 WHEN 2 THEN 2 
 WHEN 4 THEN 10 
 ELSE Col1 
 END CASE, 
 Col2 = CASE id 
 WHEN 3 THEN 3 
 WHEN 4 THEN 12 
 ELSE Col2 
 END CASE
 WHERE id IN (1, 2, 3, 4);
</p>

<p>
这种方式太过复杂，我想谁也不会在代码中这么用，所以不推荐使用。。。
</p>

<ol class="org-ol">
<li>新建临时表，把新数据放在临时表中，然后再逐条更新，示例代码（PHP）如下：
</li>
</ol>

<p>
// Reorder items
function update\_items\_tempdb(&amp;$items)
{
 shuffle($items);
 $table\_name = uniqid('tmp\_test\_');
 $sql = "CREATE TEMPORARY TABLE `$table\_name` ("
 ." `id` int(10) unsigned NOT NULL AUTO\_INCREMENT"
 .", `position` int(10) unsigned NOT NULL"
 .", PRIMARY KEY (`id`)"
 .") ENGINE = MEMORY";
 query($sql);
 $i = 0;
 $sql = '';
 foreach ($items as &amp;$item)
 {
 $item-&gt;position = $i++;
 $sql .= ($sql ? ', ' : '')."({$item-&gt;id}, {$item-&gt;position})";
 }
 if ($sql)
 {
 query("INSERT INTO `$table\_name` (id, position) VALUES $sql");
 $sql = "UPDATE `test`, `$table\_name` SET `test`.position = `$table\_name`.position"
 ." WHERE `$table\_name`.id = `test`.id";
 query($sql);
 }
 query("DROP TABLE `$table\_name`");
}
</p>


<p>
总结一下：对于少量的更新，我们仍将使用单查询更新一条记录的方式（指的是根据Unique字段查询的单条结果）。如果更新数据大到某张表（百万数据量）的一半时，我们将使用临时表方案，也就是这里说的第三种方案。
</p>

</section>



<footer id="footer">
    Send comments, critique and suggestions to <a href="mailto:guweigang &lt;at&gt; outlook &lt;dot&gt; com">Gu Weigang</a>.
    Powered by <a href="https://github.com/kelvinh/org-page">org-page</a>
</footer>

  </body>
</html>
